package com.realtime.enums;

public enum AUTO_APPL_HDL_CD {
	
	E01("회원로그인LOCK상태"),
	E02("회원재직이아닌상태"),
	E03("제도미할당회원"),
	E10("제도미존재"),
	E11("가족카드사용불가"),
	E12("할부카드사용불가"),
	E13("해외카드사용불가"),
	E14("허용불가 전용카드"),
	E20("자동신청 제외대상"),
	F01("자동신청 미설정대상(업체,업종,가맹점)"),
	F02("기신청비용"),
	P01("포인트차감시오류"),
	P02("포인트부족"),
	P03("자동신청시오류"),
	P10("포인트차감취소시오류"),
	S01("자동신청 대상"),
	S02("자동승인 대상"),
	S03("자동신청완료"),
	S04("자동취소완료"),
	S05("매출취소성공"),
	X01("존재하지 않는 CI"),
	X10("배치미설정상태"),
	X11("자동신청미사용상태"),
	XX("기타오류"),
	
	R10("분할"),
	R20("할부"),
	R30("가족"),
	R90("회원정보없음"),
	R99("기타");
	
	
	private String _name;
	
	private AUTO_APPL_HDL_CD(String name) {		
		this._name = name;
	}
	
	public String getName() {
		return _name;
	}
}
